index=main host=nikoserver sourcetype=linux_secure "Failed password" "sshd"
| rex "Failed password for (invalid user )?(?<user>\S+) from (?<src_ip>\d{1,3}(\.\d{1,3}){3})"
| bin _time span=5m
| stats count as fail_count dc(user) as uniq_users values(user) as users by src_ip _time host
| where fail_count >= 10
| sort - fail_count
